Revit 2027 API
BuiltInFailures.ColumnFailures.ColumnTopBelowBaseFailure Property
 The column top can't be moved below its base.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnTopBelowBaseFailure { get; }
Public Shared ReadOnly Property ColumnTopBelowBaseFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnTopBelowBaseFailure {
	FailureDefinitionId^ get ();
}
static member ColumnTopBelowBaseFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ColumnFailures Class
Autodesk.Revit.DB Namespace